{
  "backend/main.mo": "Motoko actor handling user profiles with access control plus a contact form system with admin-only retrieval and deletion.",
  "feature_evidence.json": "Feature evidence report listing packaging workflow and documentation features with associated files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries for all frontend source files describing their roles in the app.",
  "frontend/EXPORT_ZIP.md": "Documentation explaining prerequisites and steps to generate and use the project source ZIP.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Minimal HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/scripts/package-source.exclude.txt": "Exclude patterns for removing build outputs, caches, and other non-source files from the ZIP.",
  "frontend/scripts/package-source.sh": "Shell script that packages the full project source into a ZIP while applying exclusion rules.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and renders through SiteLayout.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Authorization wrapper that requires Internet Identity auth and admin role before rendering admin content.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state and clearing query cache.",
  "frontend/src/components/brand/BrandLogo.tsx": "Simple component rendering the construction logo image with configurable sizing.",
  "frontend/src/components/contact/ContactForm.tsx": "A React contact form component with validation, error handling, and submission using a custom hook.",
  "frontend/src/components/design/BrandTokens.ts": "Defines brand constants such as name, contact info, hours, and compliance text.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, navigation links, contact details, hours, and disclaimer.",
  "frontend/src/components/layout/Header.tsx": "Provides a responsive site header with navigation, branding, and mobile menu.",
  "frontend/src/components/layout/PageSection.tsx": "Reusable layout wrapper for page sections with configurable classes and IDs.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout combining header, main content outlet, and footer.",
  "frontend/src/components/projects/ProjectCard.tsx": "Displays a project preview card with image, metadata, and click handling.",
  "frontend/src/components/projects/ProjectDetailModal.tsx": "Shows a modal with full project details, image, and metadata.",
  "frontend/src/data/projects.ts": "Defines the Project interface and a list of sample project objects with details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and invalidates queries on change.",
  "frontend/src/hooks/useAdminInquiries.ts": "Hooks for fetching all contact submissions and retrieving the caller's user role.",
  "frontend/src/hooks/useDocumentTitle.ts": "Simple hook to update and restore the document title on mount and unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, identity loading, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a React Query mutation that submits contact form data via an actor and refreshes related queries on success.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables and base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app and wraps it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company history, mission, vision, and values content.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin page that lists contact inquiries, supports selection, and handles loading and error states using admin hooks.",
  "frontend/src/pages/CompliancePage.tsx": "Displays compliance information including licenses, certifications, and a detailed compliance statement.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details and embeds a contact form for user inquiries.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with a hero section, government approval highlights, and navigation actions.",
  "frontend/src/pages/ProjectsPage.tsx": "Renders the projects listing with cards and a modal that opens when a project is selected.",
  "frontend/src/pages/SafetyQualityPage.tsx": "Displays safety and quality information using sections and cards with descriptive content and icons.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of construction services with icons and descriptions plus an additional section detailing the company’s approach.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions such as colors, shadows, animations, and plugins.",
  "project_state.json": "Metadata file describing the project’s state, features, and requirements for producing a downloadable full-source ZIP."
}