{
  "backend/main.mo": "Motoko actor managing user profiles with role-based access control and a contact form system restricted to admins for viewing, indexing, and deleting submissions.",
  "feature_evidence.json": "Feature evidence report mapping implemented site features to corresponding source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing layout components, pages, design tokens, data sources, hooks, and authentication utilities.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables, themes, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all site pages and renders them through the SiteLayout root component.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "React component that restricts access to admin-only routes based on authentication and role, showing gated UI states accordingly.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states and query cache clearing.",
  "frontend/src/components/brand/BrandLogo.tsx": "Simple component rendering the construction company's generated logo image.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component with client-side validation and submission via a custom hook, showing success and error states.",
  "frontend/src/components/design/BrandTokens.ts": "Defines static brand constants including company info, contact details, and business hours.",
  "frontend/src/components/layout/Footer.tsx": "Footer layout displaying brand info, navigation links, contact details, business hours, and a disclaimer.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with desktop and mobile navigation using router state to highlight active links.",
  "frontend/src/components/layout/PageSection.tsx": "Wrapper component that renders a padded page section with optional IDs and container classes.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout component composing header, main content outlet, and footer.",
  "frontend/src/components/projects/ProjectCard.tsx": "Card component showing a project's image, category, location, year, and summary, clickable for details.",
  "frontend/src/components/projects/ProjectDetailModal.tsx": "Modal displaying full project details including images, metadata, and long description.",
  "frontend/src/data/projects.ts": "Defines the Project interface and a list of static project entries with metadata and images.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on user identity, auto-refreshing dependent queries.",
  "frontend/src/hooks/useAdminInquiries.ts": "Hooks for fetching all contact submissions and checking the caller's user role using the actor.",
  "frontend/src/hooks/useDocumentTitle.ts": "Hook that sets and restores the document title on mount and unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a React Query mutation that submits contact form data through an actor and refreshes submission queries on success.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark theme CSS variables for colors, borders, and typography.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company history, mission, vision, and values using styled sections and cards.",
  "frontend/src/pages/admin/AdminInquiriesPage.tsx": "Admin page that lists and manages contact inquiries with selection support. Uses route guarding, fetches submissions, and displays loading, error, or empty states.",
  "frontend/src/pages/CompliancePage.tsx": "Displays compliance information, licenses, and certifications using structured card layouts and styled sections.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information and a contact form, using cards to display address, phone, email, and business hours.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, government approval highlights, and navigation links to other site areas.",
  "frontend/src/pages/ProjectsPage.tsx": "Renders a projects listing page with cards and opens a detail modal when a project is selected. Manages modal state and sets the document title.",
  "frontend/src/pages/SafetyQualityPage.tsx": "Displays detailed safety and quality information using sections and UI cards. Sets the page title and presents structured content with icons.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of service offerings with icons and descriptions and includes an additional section explaining the company’s approach. Sets the document title and maps service data into cards.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters with support for hash routing. Includes utilities for persisting parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, fonts, animations, and plugins. Defines content paths and site-wide styling tokens.",
  "project_state.json": "Defines project state for a government‑approved construction company website, including required images, planned features, and schema/version metadata."
}