{
  "kind": "build_request",
  "title": "Provide downloadable ZIP of full project source code (frontend + backend)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a repository-level packaging/export workflow that produces a single ZIP archive containing the full project source code (frontend + backend), suitable for the user to download and run locally.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "full project code"
        ]
      },
      "acceptanceCriteria": [
        "A single ZIP archive (e.g., project-source.zip) can be generated that includes backend/ and frontend/ source files needed to build and deploy the app.",
        "The ZIP archive excludes large/generated folders (e.g., node_modules/, .dfx/, dist/build artifacts) to keep the download small and source-focused.",
        "The ZIP archive preserves required config files and manifests needed to run locally (e.g., dfx.json/package manifests if present) without manual reconstruction.",
        "Running the packaging command/script twice produces a valid ZIP without errors and overwrites/updates the previous ZIP deterministically."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add clear, English documentation describing how to obtain and use the exported ZIP (how to unzip, install dependencies, run locally, and deploy to the Internet Computer).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "full project code"
        ]
      },
      "acceptanceCriteria": [
        "Documentation exists in a top-level README section or a dedicated markdown file and is written in English.",
        "Docs include the exact steps to: unzip the project, install frontend dependencies, start the frontend, and deploy the Motoko canister with dfx.",
        "Docs mention any prerequisites (e.g., Node.js/npm, DFX) and where the backend and frontend live in the folder structure."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose instead).",
    "Do not add external databases or third-party auth providers; Internet Identity only."
  ],
  "nonGoals": [
    "Adding new website features or changing existing UI/branding beyond what is required to support exporting/downloading the code.",
    "Implementing an in-app code editor or serving source code ZIPs from the Motoko canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}