{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Source export ZIP packaging (frontend-only wiring)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a packaging workflow script that generates a single deterministic ZIP containing full project source while excluding large/generated folders.",
      "acceptanceCriteria": [
        "A single ZIP archive (e.g., project-source.zip) can be generated that includes backend/ and frontend/ source files needed to build and deploy the app.",
        "The ZIP archive excludes large/generated folders (e.g., node_modules/, .dfx/, dist/build artifacts) to keep the download small and source-focused.",
        "The ZIP archive preserves required config files and manifests needed to run locally (e.g., dfx.json/package manifests if present) without manual reconstruction.",
        "Running the packaging command/script twice produces a valid ZIP without errors and overwrites/updates the previous ZIP deterministically."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/package-source.sh",
          "operation": "create",
          "description": "Create a repo packaging script that runs from within frontend/ and produces a single ZIP archive (e.g., ../project-source.zip) containing the full project source (frontend/ + backend/ + key repo config files), while excluding large/generated directories (node_modules, .dfx, dist/build outputs, cache folders). Ensure deterministic overwrite by deleting/overwriting any existing ZIP and using stable exclusion patterns."
        },
        {
          "path": "frontend/scripts/package-source.exclude.txt",
          "operation": "create",
          "description": "Add a centralized exclude-pattern list referenced by the packaging script to keep the ZIP source-focused (e.g., node_modules/, .dfx/, dist/, build artifacts, coverage, caches). This supports consistency across repeated runs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add English documentation describing how to generate, obtain, and use the exported ZIP to run locally and deploy to the Internet Computer.",
      "acceptanceCriteria": [
        "Documentation exists in a top-level README section or a dedicated markdown file and is written in English.",
        "Docs include the exact steps to: unzip the project, install frontend dependencies, start the frontend, and deploy the Motoko canister with dfx.",
        "Docs mention any prerequisites (e.g., Node.js/npm, DFX) and where the backend and frontend live in the folder structure."
      ],
      "file_operations": [
        {
          "path": "frontend/EXPORT_ZIP.md",
          "operation": "create",
          "description": "Create English documentation describing: prerequisites (Node.js/npm, DFX), how to run the packaging script to generate the ZIP, how to unzip it, where frontend/ and backend/ live, how to install frontend dependencies, how to start the frontend locally, and how to deploy the Motoko canister with dfx."
        }
      ]
    }
  ]
}